1s/ERP/Conf/InformationRegisters/Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоглашениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоглашениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартнерПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартнерПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПлощадкаПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлощадкаПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ДанныеДляЗаполненияПоЦеновойГруппеСоо(ПлощадкаПоставщика,ПлощадкаПокупателя,Период = Неопределено, ЦеновыеГруппы=Неопределено ) Экспорт 
	
	Период=?(ЗначениеЗаполнено(Период),Период, Дата(3999, 12, 31, 23, 59, 59)); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Период КАК Период,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Регистратор КАК Регистратор,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.НомерСтроки КАК НомерСтроки,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Активность КАК Активность,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПлощадкаПоставщика КАК ПлощадкаПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПлощадкаПокупателя КАК ПлощадкаПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Работа КАК Работа,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Содержание КАК Содержание,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СтатьяРасходов КАК СтатьяРасходов,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ДоговорПоставщика КАК ДоговорПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ДоговорПокупателя КАК ДоговорПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СоглашениеПоставщика КАК СоглашениеПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СоглашениеПокупателя КАК СоглашениеПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Валюта КАК Валюта,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Цена КАК Цена,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПартнерПоставщика КАК ПартнерПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.КонтрагентПоставщика КАК КонтрагентПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПартнерПокупателя КАК ПартнерПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.КонтрагентПокупателя КАК КонтрагентПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПодразделениеПоставщика КАК ПодразделениеПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПодразделениеПокупателя КАК ПодразделениеПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.СрезПоследних(
	|			&Период,
	|			ПлощадкаПоставщика = &ПлощадкаПоставщика
	|				И ПлощадкаПокупателя = &ПлощадкаПокупателя
	|				И ВЫБОР
	|					КОГДА &ЕстьФильтрЦГ
	|						ТОГДА ЦеноваяГруппа В (&ЦеновыеГруппы)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("ПлощадкаПоставщика",ПлощадкаПоставщика ); 
	Запрос.УстановитьПараметр("ПлощадкаПокупателя",ПлощадкаПокупателя );
	Запрос.УстановитьПараметр("Период",Период );
	Запрос.УстановитьПараметр("ЦеновыеГруппы", ЦеновыеГруппы );
	Запрос.УстановитьПараметр("ЕстьФильтрЦГ", ЗначениеЗаполнено(ЦеновыеГруппы));
	
	
	ТЗ = Запрос.Выполнить().Выгрузить();; 
	
		
	Соответствие = Новый Соответствие;
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		
		
		Соответствие.Вставить(СтрокаТЗ.ЦеноваяГруппа,ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТЗ));
		
		
	КонецЦикла; 
	
	
	
	
	
Возврат Соответствие;	
	
	
	
КонецФункции 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
